# Pandas

In [5]:
import pandas as pd

In [8]:
seri = pd.Series([1, 2, 3, 4, 5])
seri

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [9]:
type(seri)

pandas.core.series.Series

In [10]:
seri.size

5

In [11]:
seri.ndim

1

In [12]:
seri.dtype

dtype('int64')

In [13]:
seri.values

array([1, 2, 3, 4, 5], dtype=int64)

In [15]:
seri.head() # ilk 5 veri

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [16]:
seri.head(3)

0    1
1    2
2    3
dtype: int64

In [17]:
seri.tail() # son 5 veri

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [18]:
seri.tail(3)

2    3
3    4
4    5
dtype: int64

In [19]:
pd.Series([99,34,24,65,35], index = [1,3,5,7,9])

1    99
3    34
5    24
7    65
9    35
dtype: int64

In [20]:
seri = pd.Series([4,2,8,0,3], index = ["a", "b", "c", "d", "e"])

In [21]:
seri

a    4
b    2
c    8
d    0
e    3
dtype: int64

In [22]:
seri["a"]

4

In [23]:
seri["a": "c"]

a    4
b    2
c    8
dtype: int64

In [24]:
#sözlük üzerinden liste oluşturmak

In [25]:
sozluk = pd.Series({"reg": 10, "log": 12, "cart": 14})

In [26]:
sozluk

reg     10
log     12
cart    14
dtype: int64

In [27]:
sozluk = {"reg": 10, "log": 12, "cart": 14}

In [28]:
pd.Series(sozluk)

reg     10
log     12
cart    14
dtype: int64

In [29]:
pd.concat([seri, seri])

a    4
b    2
c    8
d    0
e    3
a    4
b    2
c    8
d    0
e    3
dtype: int64

In [30]:
import numpy as np

In [31]:
a = np.array([22,5,3,2,80])

In [33]:
b = pd.Series(a)
b

0    22
1     5
2     3
3     2
4    80
dtype: int32

In [34]:
b[0]

22

In [35]:
b[0:3]

0    22
1     5
2     3
dtype: int32

In [37]:
seri = pd.Series([3, 4, 2, 8], index = ["reg", "loj", "cart", "rf"])

In [38]:
seri

reg     3
loj     4
cart    2
rf      8
dtype: int64

In [40]:
seri.index

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [41]:
seri.keys

<bound method Series.keys of reg     3
loj     4
cart    2
rf      8
dtype: int64>

In [42]:
list(seri.items())

[('reg', 3), ('loj', 4), ('cart', 2), ('rf', 8)]

In [43]:
'reg' in seri

True

In [44]:
"log" in seri

False

In [45]:
"loj" in seri

True

In [46]:
seri["reg"]

3

In [47]:
# fancy eleman

In [48]:
seri[["reg", "loj"]]

reg    3
loj    4
dtype: int64

In [51]:
seri["reg":"cart"]

reg     3
loj     4
cart    2
dtype: int64

# Pandas DataFrame oluşturma

In [56]:
l = [1, 2, 39, 67, 90]
l

[1, 2, 39, 67, 90]

In [59]:
pd.DataFrame(l, columns = ["degisken_ismi"])

   degisken_ismi
0              1
1              2
2             39
3             67
4             90

In [8]:
import numpy as np
import pandas as pd

In [6]:
m = np.arange(1, 10).reshape(3,3)

In [9]:
pd.DataFrame(m, columns = ["var1", "var2", "var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [10]:
# df isimlendirme

In [11]:
df = pd.DataFrame(m, columns = ["var1", "var2", "var3"])
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [12]:
type(df)

pandas.core.frame.DataFrame

In [13]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['var1', 'var2', 'var3'], dtype='object')]

In [14]:
df.shape

(3, 3)

In [15]:
df.ndim

2

In [16]:
df.size

9

In [17]:
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [18]:
df.tail(1)

   var1  var2  var3
2     7     8     9

In [19]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [20]:
type(df.values)

numpy.ndarray

In [21]:
a = np.array([1, 2, 3, 4, 5])

In [22]:
pd.DataFrame(a, columns = ["value"])

   value
0      1
1      2
2      3
3      4
4      5

In [24]:
a1  = np.random.randint(10, size = 5)
a2 = np.random.randint(10, size = 5)
a3 = np.random.randint(10, size = 5)

In [25]:
sozluk = {"var1": a1, "var2": a2, "var3": a3}

In [26]:
sozluk

{'var1': array([1, 6, 0, 8, 2]),
 'var2': array([4, 7, 2, 9, 9]),
 'var3': array([6, 5, 0, 8, 1])}

In [28]:
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     1     4     6
1     6     7     5
2     0     2     0
3     8     9     8
4     2     9     1

In [30]:
df[0:1]

   var1  var2  var3
0     1     4     6

In [31]:
df[0:3]

   var1  var2  var3
0     1     4     6
1     6     7     5
2     0     2     0

In [32]:
df.index = ["a", "b", "c", "d", "e"]

In [33]:
df

   var1  var2  var3
a     1     4     6
b     6     7     5
c     0     2     0
d     8     9     8
e     2     9     1

In [35]:
df["a":"c"]

   var1  var2  var3
a     1     4     6
b     6     7     5
c     0     2     0

In [36]:
#silme

In [40]:
df.drop("a", axis = 0)

   var1  var2  var3
b     6     7     5
c     0     2     0
d     8     9     8
e     2     9     1

In [39]:
df

   var1  var2  var3
a     1     4     6
b     6     7     5
c     0     2     0
d     8     9     8
e     2     9     1

In [49]:
df.drop("b", axis = 0, inplace = True) # kalıcı olarak gitti

In [50]:
df

   var1  var2  var3
c     0     2     0
d     8     9     8
e     2     9     1

In [54]:
k = ["d", "e"]

In [55]:
df.drop(k, axis = 0)

   var1  var2  var3
c     0     2     0

In [56]:
df

   var1  var2  var3
c     0     2     0
d     8     9     8
e     2     9     1

In [60]:
"var1" in df

True

In [59]:
8 in df

False

In [61]:
l = ["var1", "var2", "var3"]

In [63]:
for i in l:
    print(i in df)

True
True
True

In [67]:
l = ["var1", "var4", "var3"]

In [68]:
for i in l:
    print(i in df)

True
False
True

In [69]:
df["var4"] = df["var1"] / df["var2"]

In [70]:
df

   var1  var2  var3      var4
c     0     2     0  0.000000
d     8     9     8  0.888889
e     2     9     1  0.222222

# Gözlem ve Değişken Seçimi : loc and iloc